Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K34.tmx
Source language: en_us
Languages: zh_cn

source: Means of Suppressing Demonstrations
zh_cn: 镇压示威的手段

source: Lea, the officer, had stopped feeling her own body.
zh_cn: 军官莉，对她自己的身体已经没有感觉了。

source: She lay on top of an anti-sniper barricade, holding up a page from a newspaper, blocking the stars.
zh_cn: 她躺在一个街垒的顶部，举着一张报纸挡住了星星。

source: She had to stretch out her arms to hold the wide page above her head.
zh_cn: 她不得不伸出她的手臂举着她头上的宽宽的报纸。

source: "Oh," she said.
zh_cn: “噢，”她说。

source: "The Army didn't do it," Tomer said.
zh_cn: “不是军队干的，“托莫说。

source: He flicked his cigarette butt down onto the asphalt of Route 799.
zh_cn: 他把烟蒂弹落到799号干线的沥青路面上。

source: He was talking about Huda, the little Palestinian girl on the beach.
zh_cn: 他说的是霍达，在沙滩上的那个巴勒斯坦小女孩。

source: The picture in the newspaper showed her screaming on red sand, amid the body parts of the seven people who had been her family.
zh_cn: 报纸上的照片显示她在红色的沙滩上尖叫着，在她七个家人破碎的尸体中间。

source: "I know," she said.
zh_cn: “我知道，”她说。

source: "This is a manipulation."
zh_cn: “这是栽赃。”

source: The world said that the Israeli Army had done it with artillery fire, but the Israeli Army knew that the family had been killed by a dormant shell that Palestinian militants had left by the sea.
zh_cn: 国际上说，这是以色列军队的炮火干的，但以色列军队知道这个家庭是被巴勒斯坦武装分子留在海边的一个潜藏的炮弹杀死的。

source: Lea looked at Tomer.
zh_cn: 莉看着托莫。

source: The orange light of the road lamps lit him from behind, so that he could have been a demon.
zh_cn: 路灯的橙色灯光从他身后照亮了他，看起来他好像原本是一个魔鬼。

source: He was nineteen, two years younger than the officer.
zh_cn: 他十九岁，比长官小两岁。

source: "It's just that I can't feel my body all of a sudden," she said.
zh_cn: “我的身体突然失去知觉，”她说。

source: "Again?"
zh_cn: “又这样了？”

source: Lea often told him that she couldn't feel her body.
zh_cn: 莉经常告诉他，她感觉不到她的身体。

source: That she could move it, but not feel it.
zh_cn: 她可以移动它，但感觉不到它。

source: That those were two separate things.
zh_cn: 这是两回事。

source: He never questioned her; he pushed her.
zh_cn: 他从来没有质疑她，他推着她。

source: This was what she wanted.
zh_cn: 这就是她想要的。

source: Tomer took his weapon off his back and pressed her shoulders into the concrete.
zh_cn: 托莫从背部解下武器，然后死死地把她的肩膀压在水泥地上。

source: When their pants were pulled down, he pressed his hands on her neck, then her arms.
zh_cn: 当他们的裤子被拉下时，他的手按在她的脖子上，然后是她的手臂上。

source: He called her Lea during the day, because it was her name, and because she said he could.
zh_cn: 白天，他叫她莉，因为这是她的名字，因为她说他可以这样叫她。

source: At night, when he pulled her hair so hard that her scalp buzzed, he called her Officer, because it was what she said he should call her then.
zh_cn: 晚上，当他使劲地扯着她的头发，以至于她的头皮嗡嗡作响的时候，他称呼她长官，因为是她说这时他应该这么称呼她。

source: When she looked to the side, she could see the warm glow that came from the homes of people in nearby villages.
zh_cn: 当她看向一侧，她可以看到来自附近村庄人们家里温暖的光晕。

source: She knew that her military service was approaching its end, but could not feel it.
zh_cn: 她知道她的兵役就要结束了，但是感觉不到。

source: She could not imagine or remember any of the things she had wanted before she became a soldier, and struggled to find things she wanted for her civilian life ahead.
zh_cn: 她无法想象或记起在她成为一名士兵前想要的任何东西，并且提前开始努力地想着，她希望过什么样的平民生活。

source: She guessed that she must want a family, or to get into a good school, but she guessed this from the data around her.
zh_cn: 她猜想她肯定会想要一个家庭，或进入一个好学校，但是她这样猜是因为周围的人都是这样的。

source: She did not feel the want herself.
zh_cn: 她自己感觉不到想法。

source: When she first began feeling this way, less than a year into her service, after the neck of one of the soldiers at her checkpoint was cut almost in half, she decided that the only reasonable thing she could truly want must exist inside the Army, so she applied to become an officer.
zh_cn: 当她在服兵役还不到一年的时候，她所在的检查站的一个士兵的脖子差点被砍成两截之后，她第一次有这样的感觉，她想通了她真正想要的唯一理性的东西，就是必须在军队里生存下去，所以，她申请成为一名军官。

source: She did not want to be a dumb checkpoint soldier anymore, the type whose neck could get cut almost in half.
zh_cn: 她不想再当一个愚蠢的检查站的士兵，那种脖子可能被差点砍成两截的士兵。

source: She wanted to be able to yell at soldiers who put their necks where they might get cut.
zh_cn: 她希望能够对着那些把脖子放在了可能被切掉的地方的士兵大声喊叫。

source: She grew to accept that her service time would begin and end in the Transitions Unit, but figured that if she had to be at a checkpoint she might as well be an officer.
zh_cn: 她渐渐接受了现实，她的服役时间将会从这个过渡单位开始，也将在此结束，但是她认为，如果她不得不呆在一个检查站，她还是可以成为一名军官。

source: Tomer did almost everything that she asked of him.
zh_cn: 托莫做了几乎所有她让他做的事情。

source: He was a sensible nineteen-year-old boy.
zh_cn: 他是个懂事的19岁男孩。

source: And Lea, she had a certain beauty, after all.
zh_cn: 莉，她毕竟有一定的美貌。

source: A cold, humming, unfazed beauty, and great breasts.
zh_cn: 一种冷淡的，忙碌而无忧的美貌，以及巨大的乳房。

source: She was also the only girl sprinkled into his days.
zh_cn: 她也是洒落在他的生活的中唯一的女孩。

source: Lea woke up alone in her field bed the next morning.
zh_cn: 第二天早晨，莉在她营地的床上独自醒了。

source: She had her own tent, because she was the only female at the checkpoint.
zh_cn: 她有她自己的帐篷，因为在检查站她是唯一的女性。

source: It was an odd posting.
zh_cn: 这是一个奇怪的派遣。

source: Route 799 cut through the West Bank, but had been closed to Palestinians since 2002, when the motorcyclists were shot.
zh_cn: 虽然799号干线穿越西岸，但自从2002年摩托车手被射击后，它已经对巴勒斯坦人关闭了。

source: The Army needed four soldiers and a commanding officer to staff an improvised checkpoint every hundred kilometres or so, so she found herself commanding four boys who took shifts on an always deserted road.
zh_cn: 大约每百公里左右，军队需要给一个简易的检查站配置四名士兵和指挥官，所以，她发现自己指挥着四个总是在冷清的道路上轮班执勤的男孩。

source: But if anyone did decide to show, even after all this time, there would be someone there to say, "Sorry, the road is blocked."
zh_cn: 但如果实在有人决定要出现，即便总在这个时候，就得有人在那儿说，“对不起，这条路封了。”

source: The posting would have made her angry, except she knew that her service would be over in a few weeks anyway.
zh_cn: 这个派遣让她气恼，虽然她知道，不管怎样再过几周她的服役就要结束了。

source: She spent the day in bed, reading a prep book for university entrance exams.
zh_cn: 她花了一整天在床上阅读一本准备大学入学考试的书。

source: She hoped to score high enough to study business.
zh_cn: 她希望能考一个高分以学习商业。

source: She was supposed to check in with the boy on duty twice a shift, but she didn't bother, because nothing ever happened.
zh_cn: 她本应该在一个班次里查看两次值班的男孩，但她没有去，因为什么都没有发生过。

source: Except, that day, something did.
zh_cn: 除了，那一天，有事发生了。

source: Tomer, who had the afternoon shift, called her military cell to say that there were three Palestinian male demonstrators at the checkpoint.
zh_cn: 托莫，值下午班，给她的军用手机打电话说，有三名巴勒斯坦男性示威者在检查站。

source: "Have they thrown rocks or anything?" she asked.
zh_cn: “他们投掷石头或什么了吗？”她问道。

source: "No, but they have a sign.
zh_cn: “没有，但他们有一个标语。

source: And they keep on asking me to, like, disperse them, even though I explained that we don't have any means of suppressing demonstrations here."
zh_cn: 并且他们不停地让我，好像是，驱散他们，尽管我解释说，在这儿我们没有任何镇压示威的手段。“

source: "That's not true."
zh_cn: “这不是真的。”

source: She was suddenly more excited than she had been since she was posted to Route 799.
zh_cn: 她突然有一种，自从被派遣到799号干线以来，从未有过的兴奋。

source: As an officer, she knew that every checkpoint had a supply box to be used in case of demonstrations.
zh_cn: 作为一名军官，她知道，每一个检查站，有一个用于示威情况的供应箱。

source: And, if the demonstrators insisted, she must aim to please.
zh_cn: 并且，如果示威者坚持，她一定要他们满意。

source: She unlocked the metal supply closet in her tent and pulled out a wooden box.
zh_cn: 在她的帐篷里，她打开金属供应柜，掏出一个木箱。

source: It was heavy, so it took her a while to carry it to the anti-sniper barricade, and then to cross the road to the sun umbrella that marked the checkpoint.
zh_cn: 它很重，所以她颇费了一阵子把它搬到街垒处，然后穿过马路，到了标志着检查站的太阳伞那。

source: "We had a lesson about demonstrations and stuff in boot camp, but I forget," Tomer said.
zh_cn: 托莫说：“我们上过一个关于示威的课，并且在新兵训练营中有资料，但是我忘了”。

source: Two of the demonstrators were in their thirties, and one was just a boy, a boy with his fingers in his mouth.
zh_cn: 两名示威者都是大约30岁，还有一名就是个男孩，一个手指放在嘴里的男孩。

source: They had a piece of A4 paper on which they had written "Open 799" in English, with a marker.
zh_cn: 他们有一张A4纸，在上面他们用记号笔用英文写着“打开799”。

source: One of the men was wearing a Guns N' Roses T-shirt.
zh_cn: 其中一个男人身穿枪炮与玫瑰乐队的T恤。

source: He raised his hand, and so she signalled him to step forward.
zh_cn: 他举起了手，于是她示意他往前走。

source: When he was four steps away, she signalled him to halt.
zh_cn: 当他走到还有四步远时，她示意他停住。

source: "Officer, we are here to demonstrate against the restriction of our mobility, which is a collective punishment and against international law," the demonstrator said, in solid, accented Hebrew.
zh_cn: “长官，我们在这里示威是抗议对我们流动性的限制，这是一个集体的惩罚，是违反国际法的，”示威者有根有据地说，带着希伯来语口音。

source: She put one hand on her weapon and one in her pocket.
zh_cn: 她一只手放在她的武器上，另一只在她的口袋里。

source: "How come there are only three of you?
zh_cn: “怎么只有你们三个？

source: This is hardly a demonstration."
zh_cn: 这很难算是一个示威。”

source: "I do apologize, Officer.
zh_cn: “我很抱歉，长官。

source: We have a wedding this week in the village, and, you see, other people, they are not serious," he said.
zh_cn: 本周我们在村里有一个婚礼，而且，你看，其他人，他们都不认真对待，“他说。

source: He bowed a little when he spoke.
zh_cn: 他说话的时候，略微躬了一下身。

source: "Is there any way you could disperse us just a little - enough for a press blast, or something?"
zh_cn: “你有没有什么办法可以稍稍驱散我们一下？或者别的什么，只要足以让记者写篇抨击的新闻就可以了”

source: She had meant to be cruel, but the man was rather sweet.
zh_cn: 她本来想要冷酷一些，但这个男人非常温柔。

source: He looked more like a bank customer asking for an increase of his credit limit than like a demonstrator.
zh_cn: 他看上去不像是一名示威者，而更像是一个要求增加信用额度的银行客户。

source: It made her feel, a little, like this was the real world.
zh_cn: 这让她感到，有一点点，好像这就是真实的世界。

source: "We'll see what we can do," she said.
zh_cn: “我们会看看能做些什么，”她说。

source: She sat on the asphalt and opened the wooden box.
zh_cn: 她坐在沥青路面上，打开了木箱。

source: There were printed instructions tucked inside a sheer nylon sleeve.
zh_cn: 有一些印刷好的说明书被塞在一个极薄的尼龙套里。

source: Tomer signalled the man to step back and wait, then he sat by her and they both read:
zh_cn: 托莫示意那个男人后退一步，等着，然后他坐在她的身边，他们一起开始阅读：

source: The purpose of Means of Suppressing Demonstrations is to suppress demonstrations.
zh_cn: 制作这份‘镇压示威的手段’的目的是为了镇压示威。

source: It is intended to intimidate, and at most injure, but the purpose is not to kill.
zh_cn: 它意在恐吓，最多是伤害，但其目的不是致命。

source: One general guideline:
zh_cn: 一个总体指南：

source: Use from light to heavy: shock, tear gas, rubber.
zh_cn: 由轻到重使用：震惊，催泪瓦斯，橡皮子弹。

source: We must minimize damage when possible.
zh_cn: 在可能的情况下，我们必须做到最小程度的损害。

source: Grenade 30, the shock grenade, was designed to stun and scare by creating a loud noise.
zh_cn: 30号手榴弹，震荡手榴弹，是用于通过制造一个巨大的声响来使其昏迷和恐慌。

source: The instructions said that, if detonated within two metres of a person, the grenade could damage the eardrums and cause light injuries, so Lea told the demonstrators to step back a bit.
zh_cn: 说明书上说，如果在一个人的两米之内引爆，手榴弹可能会损害耳膜，造成轻微伤害，因此莉告诉示威者后退一点。

source: They backed up, still facing the sun umbrella, and after a while the boy took his fingers out of his mouth and gave her a hesitant thumbs-up.
zh_cn: 他们后退了一些，仍然面朝着太阳伞，过了一会儿，那个男孩把手指从嘴里拿了出来，给了她一个迟疑的竖起的大拇指。

source: She didn't know quite how to respond, so she gave him a thumbs-up, too.
zh_cn: 她不完全确定该如何回应，所以她也给了他一个竖起的大拇指。

source: Then she quickly put her hand back on her weapon.
zh_cn: 然后，她迅速把她的手放回到了武器上。

source: The shock grenade was orange, and cone-shaped. It had a red stripe encircling it.
zh_cn: 震荡手榴弹是橙色的，锥形，环绕着红色的条纹。

source: She held it in her hand and then bent to the ground to lift a rock.
zh_cn: 她把它拿在手上，然后弯腰在地上捡起一块石头。

source: She dropped it into Tomer's hand.
zh_cn: 她把石头丢到托莫手里。

source: "You're the soldier," she said.
zh_cn: “你是军人，”她说。

source: "And, besides, it's been longer since I last learned about this stuff.
zh_cn: “此外，我已经很久没有用过这个东西了。

source: Let's practice."
zh_cn: 我们来练习一下。“

source: They pretended that the rock was a grenade.
zh_cn: 他们假装那块石头是一枚手榴弹。

source: She gave him the instructions as if she knew them by heart.
zh_cn: 她给他讲着说明，就好像她都能记着。

source: She reminded him to keep the grenade in the palm of his hand and to secure the lever with his index finger.
zh_cn: 她提醒他继续把手榴弹握在手里，并把食指搭在扣环上。

source: She explained how to thread the middle finger of his left hand inside the safety, as if it were a ring, and to pull it with a spin of his wrist, as if he were checking his watch.
zh_cn: 她解释如何把左手的中指穿入保险杆的内侧，仿佛它是一个环，然后旋转手腕拉一下，就像是他在查看手表。

source: She raised her voice at him a bit, because he pulled his arm back for the practice throw without keeping his eyes on it.
zh_cn: 她略微抬高了对他说话的声音，因为他为了练习投掷把胳膊伸到了身后，而没有保持目光注视着它。

source: "The instructions say after you take the safety out you have to look at the grenade at all times, because you only have three and a half seconds until it explodes.
zh_cn: “说明书说在你放开保险杆后必须一直盯着手榴弹，因为只需要三秒半它就会爆炸。

source: What if you took your hand back and hit a wall?"
zh_cn: 如果你手伸向后面却碰到了墙上，你该怎么办？”

source: "But I know there's no wall behind me," he said.
zh_cn: “但是我知道我身后没有墙啊，”他说。

source: "What if there were, suddenly?
zh_cn: “如果突然有了呢? 怎么办？

source: What if a bird came?
zh_cn: 如果来了一只鸟怎么办？

source: It is not nice to have something explode in your hand, even a shock grenade."
zh_cn: 如果有什么东西在你手里爆炸了可不是好事，即使那只是一个震荡手榴弹。”

source: After a couple of dry runs, it was time for the real thing.
zh_cn: 经过几次演练后，现在是用真家伙的时候了。

source: The boy had his fingers in his mouth again, and one of the men was wiping his brow.
zh_cn: 那个男孩又把他的手指放进了嘴里，其中一个男人在擦他的额头。

source: Heat radiated from the asphalt between them.
zh_cn: 他们之间的沥青路面放射着热浪。

source: "O.K.?" she shouted. Then she and Tomer put their earplugs in.
zh_cn: “准备好了吗？”她大声喊道，然后她和托莫带上了耳塞。

source: She thought that anything one could guard against with pieces of foam could not be so powerful, but each time a grenade exploded she felt the noise in her hip bones like a jolt and in her mouth like a hint of metal.
zh_cn: 她原以为，任何一个可以用泡沫件来防御的东西都不可会如此强大，但每次当一颗震荡手榴弹爆炸时，她都觉得响声是在她的髋骨里震荡，并且在她的嘴好像有一股淡淡的金属的味道。

source: After four grenades, the demonstration was dispersed.
zh_cn: 用了4颗手榴弹后，示威被驱散了。

source: Everything went according to plan, just as anyone who was standing in her position would have anticipated.
zh_cn: 一切都是按计划进行的，任何一个站在她的位置上的人都会预料到。

source: During her school years, she had felt as if every minute were part of a race. Get that grade. That boy. That shirt.
zh_cn: 在她的学校生涯中，她曾经感到好像每一分钟都是比赛的一部分，争学分，争男孩，争衬衫。

source: The Army was a numbing respite from that eighteen-year-long breathless race.
zh_cn: 军队是那18年之久喘不过气来的比赛中的一个麻木的喘息。

source: Whatever she did, the Army would end when it ended.
zh_cn: 不管她做过什么，她的军队生涯在该结束的时候就会结束。

source: She would arrive at the same spot, that same station near the base where soldiers return their uniforms at long last.
zh_cn: 她会到达同一地点，基地附近的同一车站，在那里士兵们最后终于归还了制服。

source: Most of her days involved procedures and orders, going from one dot to the next in what appeared to be the only possible straight line.
zh_cn: 在她大多数的日子里，生活就是程序和命令，从一个点到下一个点，似乎是唯一可能的直线。

source: She tried, a bit, still, sometimes, to jut out of the line, the way a drawn line jutted during her school years when her thumb on a ruler forced the pencil off course.
zh_cn: 她尝试过，一点点，虽然只是有时，从直线里突出来，就像是她在学校里画线时，她尺子上的大拇指把铅笔压出了线，画突出来了那样。

source: She tried with sex, with pain, with shocking newspaper articles, sometimes, but she did not try too hard.
zh_cn: 她尝试过，用性，用疼痛，用令人震惊的报纸上的文章，只是有时侯，但她没有很努力去试。

source: TEAR GAS
zh_cn: 催泪瓦斯

source: The story in the newspaper that Tomer brought to the barracks that night was about a girl who'd been killed by her mother.
zh_cn: 那天晚上托莫带回军营的报纸上讲的是有关一个女孩儿被她的妈妈杀死的事件。

source: The girl was an Israeli Arab from a northern village, and she had got pregnant by her neighbor, who had raped her and was expected to receive a harsh sentence.
zh_cn: 那个女孩是来自以色列北部村庄的阿拉伯人，她被一个邻居强奸并导致怀孕，那个强奸者预计将被重判。

source: A picture showed the girl on the day of her high-school graduation, smiling and wearing jeans.
zh_cn: 在一张那个女孩高中毕业那天的照片上，她穿着牛仔裤，面带微笑。

source: She had a generous, good-girl smile.
zh_cn: 那是一个大方的，好女孩的笑容。

source: She looked like the kind of schoolgirl you couldn't even gossip with about soap-opera characters.
zh_cn: 她看起来是那种你甚至不会用肥皂剧人物性格去议论的女生。

source: The mother was expected to receive a light sentence, because she had acted in the name of honor, and out of passion, and one has to respect another's culture.
zh_cn: 母亲有望获得从轻判处，因为她为荣誉而做出这种事，出于激情，而人们要尊重他人的文化。

source: She had used knives and a cane and a plastic bag, and she swore that she had first urged the girl to take her own life.
zh_cn: 她用了刀子，一根拐杖和一个塑料袋，她发誓，她曾极力劝女孩自己结束自己的生命。

source: The officer let the boys keep the newspaper that the delivery truck brought every morning, with the understanding that Tomer would save her the most shocking parts to read at night.
zh_cn: 军官让男孩们保留着每天早晨送货卡车带来的报纸，因为她知道晚上托莫会把最令人震惊的内容读给她听。
